java.labs/testcasestatistics/data/Testsets-work/OGE_22_Buchung_von_Auktionsergebnissen/ECGPECM-5296_Auktionsbuchung_Umwandlung.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns="http://tracx.de/pkp/interfaces/msg/1.0" xmlns:ns1="http://tracx.de/pkp/interfaces/core/1.0">
   <soapenv:Header/>
   <soapenv:Body>
                 
<pkp-msg:auctionBookingRequestMessage xmlns:pkp-core="http://tracx.de/pkp/interfaces/core/1.0" xmlns:pkp-msg="http://tracx.de/pkp/interfaces/msg/1.0">
         <pkp-core:messageIdentification>9cd46eba-0aa0-3d49-2151-6ae1df0f98c4</pkp-core:messageIdentification>
         <pkp-core:creationDateTime>2011-06-17T11:00:25.658+02:00</pkp-core:creationDateTime>
         <pkp-core:sender>
            <pkp-core:identificationCode>PKP</pkp-core:identificationCode>
         </pkp-core:sender>
         <pkp-core:recipient>
            <pkp-core:identificationCode>9870006901111</pkp-core:identificationCode>
         </pkp-core:recipient>
         <pkp-msg:auctionID>32866352</pkp-msg:auctionID>
         <pkp-msg:booking>
            <pkp-msg:shipper>
              <pkp-core:authorityCode>DVGW</pkp-core:authorityCode>
               <pkp-core:identificationCode>9870099200007</pkp-core:identificationCode>
            </pkp-msg:shipper>
            <pkp-msg:shipperUser>user047.TK47@btc-ag.com</pkp-msg:shipperUser>
            <pkp-msg:dealID>32866307</pkp-msg:dealID>
            <pkp-msg:capacity>
               <ns:offerID xmlns:ns="http://tracx.de/pkp/interfaces/core/1.0">PM-FZK-EN-7000690-13YDE2-4-B-20110701</ns:offerID>
               <ns:location xmlns:ns="http://tracx.de/pkp/interfaces/core/1.0">
                  <ns4:identifier xmlns="http://tracx.de/pkp/internal/core/1.0" xmlns:ns2="http://tracx.de/pkp/internal/masterdata/1.0" xmlns:ns3="http://tracx.de/pkp/processes/services/AuctionService/1.0" xmlns:ns4="http://tracx.de/pkp/interfaces/core/1.0" xmlns:ns5="http://tracx.de/pkp/interfaces/msg/1.0" xmlns:ns6="http://tracx.de/pkp/internal/trading/1.0" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsc="http://tracx.de/pkp/processes/services/FcfsBookingService/1.0">
                     <ns4:authorityCode>EIC</ns4:authorityCode>
                     <ns4:identificationCode>13YDE2-4-B</ns4:identificationCode>
                  </ns4:identifier>
                  <ns4:type xmlns="http://tracx.de/pkp/internal/core/1.0" xmlns:ns2="http://tracx.de/pkp/internal/masterdata/1.0" xmlns:ns3="http://tracx.de/pkp/processes/services/AuctionService/1.0" xmlns:ns4="http://tracx.de/pkp/interfaces/core/1.0" xmlns:ns5="http://tracx.de/pkp/interfaces/msg/1.0" xmlns:ns6="http://tracx.de/pkp/internal/trading/1.0" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsc="http://tracx.de/pkp/processes/services/FcfsBookingService/1.0">ConnectionPoint</ns4:type>
               </ns:location>
               <ns:capacity xmlns:ns="http://tracx.de/pkp/interfaces/core/1.0">
                  <ns:interval>
                     <ns4:start xmlns="http://tracx.de/pkp/internal/core/1.0" xmlns:ns2="http://tracx.de/pkp/internal/masterdata/1.0" xmlns:ns3="http://tracx.de/pkp/processes/services/AuctionService/1.0" xmlns:ns4="http://tracx.de/pkp/interfaces/core/1.0" xmlns:ns5="http://tracx.de/pkp/interfaces/msg/1.0" xmlns:ns6="http://tracx.de/pkp/internal/trading/1.0" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsc="http://tracx.de/pkp/processes/services/FcfsBookingService/1.0">2011-07-01T06:00:00.000+02:00</ns4:start>
                     <ns4:end xmlns="http://tracx.de/pkp/internal/core/1.0" xmlns:ns2="http://tracx.de/pkp/internal/masterdata/1.0" xmlns:ns3="http://tracx.de/pkp/processes/services/AuctionService/1.0" xmlns:ns4="http://tracx.de/pkp/interfaces/core/1.0" xmlns:ns5="http://tracx.de/pkp/interfaces/msg/1.0" xmlns:ns6="http://tracx.de/pkp/internal/trading/1.0" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsc="http://tracx.de/pkp/processes/services/FcfsBookingService/1.0">2011-08-01T06:00:00.000+02:00</ns4:end>
                  </ns:interval>
                  <ns:direction>entry</ns:direction>
                  <ns:category>FZK</ns:category>
                  <ns:quantity>
                     <ns4:quantity xmlns="http://tracx.de/pkp/internal/core/1.0" xmlns:ns2="http://tracx.de/pkp/internal/masterdata/1.0" xmlns:ns3="http://tracx.de/pkp/processes/services/AuctionService/1.0" xmlns:ns4="http://tracx.de/pkp/interfaces/core/1.0" xmlns:ns5="http://tracx.de/pkp/interfaces/msg/1.0" xmlns:ns6="http://tracx.de/pkp/internal/trading/1.0" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsc="http://tracx.de/pkp/processes/services/FcfsBookingService/1.0">1500</ns4:quantity>
                     <ns4:unit xmlns="http://tracx.de/pkp/internal/core/1.0" xmlns:ns2="http://tracx.de/pkp/internal/masterdata/1.0" xmlns:ns3="http://tracx.de/pkp/processes/services/AuctionService/1.0" xmlns:ns4="http://tracx.de/pkp/interfaces/core/1.0" xmlns:ns5="http://tracx.de/pkp/interfaces/msg/1.0" xmlns:ns6="http://tracx.de/pkp/internal/trading/1.0" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsc="http://tracx.de/pkp/processes/services/FcfsBookingService/1.0">kWh/h</ns4:unit>
                  </ns:quantity>
                  <ns:methane>L</ns:methane>
                  <ns:assignability/>
                  <ns:biogas>false</ns:biogas>
                  <ns:bundled>false</ns:bundled>
               </ns:capacity>
               <ns:price xmlns:ns="http://tracx.de/pkp/interfaces/core/1.0"/>
            </pkp-msg:capacity>

	    <ns:capacityTransformation>
               <ns1:maxTransformation>
                  <ns1:quantity>150</ns1:quantity>
                  <ns1:unit>kWh/h</ns1:unit>
               </ns1:maxTransformation>
               <ns1:dealID>DEAL-ID-1234</ns1:dealID>
               <ns1:contractID>DEAL-ID-9988</ns1:contractID>
               <ns1:accountingGridID>123456</ns1:accountingGridID>
            </ns:capacityTransformation>
	   
         </pkp-msg:booking>
      </pkp-msg:auctionBookingRequestMessage>
   </soapenv:Body>
</soapenv:Envelope>